#///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#// Лабораторная работа №1 по дисциплине Л2гические основы интеллектуальных систем
#// Вариант 6. Нечеткая композиция max(min(a,b))
#// Выполнена студентами группы 121701 БГУИР Корсаковой, Макаренко, Чвилёвым, Рыбаковой, Кондратьевой 
#// Программа выполняет обратный нечёткий вывод.
#// 03.12.2023 
#//
#// Источник: ~

import parse, backwardChain as bk


facts, rules = parse.parse()

for el_i, el in enumerate(rules): 
    for item_i, item in enumerate(el[1]):
        rules[el_i][1][item_i] = [item[0],item[2]]

for rule in rules:
    rule = bk.column(rule[1])
    for fact in facts:
        fact = fact[1]
        bk.get_log(rule, fact)
